; domain
(define (domain dragonfly)

    ;remove requirements that are not needed
    ;(:requirements :strips)

    (:types ;todo: enumerate types and their hierarchy here, e.g. car truck bus - vehicle
        lilypad - object
    )

    ; un-comment following line if constants are needed
    ;(:constants )

    (:predicates ;todo: define predicates here
        (alighted ?x - lilypad)
    )
    (:functions
        (north)
        (east)
        (up)
        (pad_north ?l - lilypad)
        (pad_east ?l - lilypad)
        (pad_up ?l - lilypad)
        (nectar-level)
        (nectar-level-full)
        (min_north)
        (max_north)
        (min_east)
        (max_east)
        (min_up)
        (max_up)
    )

    (:action fly_north
        :parameters ()
        :precondition (and
            (>= (nectar-level) 1)
            (<= (north) (- (max_north) 1))
        )
        :effect (and (increase (north) 1)
            (decrease (nectar-level) 1)
        )
    )

    (:action fly_south
        :parameters ()
        :precondition (and
            (>= (nectar-level) 1)
            (>= (north) (+ (min_north) 1))
        )
        :effect (and (decrease (north) 1)
            (decrease (nectar-level) 1)
        )
    )

    (:action fly_east
        :parameters ()
        :precondition (and
            (>= (nectar-level) 1)
            (<= (east) (- (max_east) 1))
        )
        :effect (and (increase (east) 1)
            (decrease (nectar-level) 1)
        )
    )
    (:action fly_west
        :parameters ()
        :precondition (and
            (>= (nectar-level) 1)
            (>= (east) (+ (min_east) 1))
        )
        :effect (and (decrease (east) 1)
            (decrease (nectar-level) 1)
        )
    )

    (:action fly_up
        :parameters ()
        :precondition (and
            (>= (nectar-level) 1)
            (<= (up) (- (max_up) 1))
        )
        :effect (and (increase (up) 1)
            (decrease (nectar-level) 1)
        )
    )
    (:action fly_down
        :parameters ()
        :precondition (and
            (>= (nectar-level) 1)
            (>= (up) (+ (min_up) 1))
        )
        :effect (and (decrease (up) 1)
            (decrease (nectar-level) 1)
        )
    )

    (:action alight
        :parameters (?l - lilypad)
        :precondition (and
            (>= (nectar-level) 1)
            (= (pad_north ?l) (north))
            (= (pad_east ?l) (east))
            (= (pad_up ?l) (up))
        )
        :effect (and (alighted ?l)
            (decrease (nectar-level) 1))
    )

    (:action refuel_nectar
        :parameters ()
        :precondition (and
            (= (north) 0)
            (= (east) 0)
            (= (up) 0)
        )
        :effect (and
            (assign (nectar-level) (nectar-level-full)))
    )

)

; problem
;;Instance with 1x8x1 points
(define (problem dragonfly-p03) (:domain dragonfly)
(:objects
pad_0_0_0 - lilypad
pad_0_1_0 - lilypad
pad_0_2_0 - lilypad
pad_0_3_0 - lilypad
pad_0_4_0 - lilypad
pad_0_5_0 - lilypad
pad_0_6_0 - lilypad
pad_0_7_0 - lilypad
)
(:init (= (north) 0) (= (east) 0) (= (up) 0)
 (= (min_north) 0)  (= (max_north) 1)
 (= (min_east) 0)  (= (max_east) 8)
 (= (min_up) 0)  (= (max_up) 1)
(= (pad_north pad_0_0_0) 0)
(= (pad_east pad_0_0_0) 0)
(= (pad_up pad_0_0_0) 0)
(= (pad_north pad_0_1_0) 0)
(= (pad_east pad_0_1_0) 1)
(= (pad_up pad_0_1_0) 0)
(= (pad_north pad_0_2_0) 0)
(= (pad_east pad_0_2_0) 2)
(= (pad_up pad_0_2_0) 0)
(= (pad_north pad_0_3_0) 0)
(= (pad_east pad_0_3_0) 3)
(= (pad_up pad_0_3_0) 0)
(= (pad_north pad_0_4_0) 0)
(= (pad_east pad_0_4_0) 4)
(= (pad_up pad_0_4_0) 0)
(= (pad_north pad_0_5_0) 0)
(= (pad_east pad_0_5_0) 5)
(= (pad_up pad_0_5_0) 0)
(= (pad_north pad_0_6_0) 0)
(= (pad_east pad_0_6_0) 6)
(= (pad_up pad_0_6_0) 0)
(= (pad_north pad_0_7_0) 0)
(= (pad_east pad_0_7_0) 7)
(= (pad_up pad_0_7_0) 0)
(= (nectar-level) 21)
(= (nectar-level-full) 21)
)
(:goal (and
(alighted pad_0_0_0)
(alighted pad_0_1_0)
(alighted pad_0_2_0)
(alighted pad_0_3_0)
(alighted pad_0_4_0)
(alighted pad_0_5_0)
(alighted pad_0_6_0)
(alighted pad_0_7_0)
(= (north) 0) (= (east) 0) (= (up) 0) ))
);; end of the problem instance

; plan
1. (fly_east)
   changed: (east) from 0 to 1, (nectar-level) from 21 to 20
   goals met: 2 of 11
2. (fly_east)
   changed: (east) from 1 to 2, (nectar-level) from 20 to 19
   goals met: 2 of 11
3. (fly_east)
   changed: (east) from 2 to 3, (nectar-level) from 19 to 18
   goals met: 2 of 11
4. (alight pad_0_3_0)
   added: (alighted pad_0_3_0)
   changed: (nectar-level) from 18 to 17
   goals met: 3 of 11
5. (fly_east)
   changed: (east) from 3 to 4, (nectar-level) from 17 to 16
   goals met: 3 of 11
6. (alight pad_0_4_0)
   added: (alighted pad_0_4_0)
   changed: (nectar-level) from 16 to 15
   goals met: 4 of 11
7. (fly_west)
   changed: (east) from 4 to 3, (nectar-level) from 15 to 14
   goals met: 4 of 11
8. (fly_west)
   changed: (east) from 3 to 2, (nectar-level) from 14 to 13
   goals met: 4 of 11
9. (alight pad_0_2_0)
   added: (alighted pad_0_2_0)
   changed: (nectar-level) from 13 to 12
   goals met: 5 of 11
10. (fly_west)
   changed: (east) from 2 to 1, (nectar-level) from 12 to 11
   goals met: 5 of 11
11. (alight pad_0_1_0)
   added: (alighted pad_0_1_0)
   changed: (nectar-level) from 11 to 10
   goals met: 6 of 11
12. (fly_east)
   changed: (east) from 1 to 2, (nectar-level) from 10 to 9
   goals met: 6 of 11
13. (fly_east)
   changed: (east) from 2 to 3, (nectar-level) from 9 to 8
   goals met: 6 of 11
14. (fly_east)
   changed: (east) from 3 to 4, (nectar-level) from 8 to 7
   goals met: 6 of 11
15. (fly_east)
   changed: (east) from 4 to 5, (nectar-level) from 7 to 6
   goals met: 6 of 11
16. (alight pad_0_5_0)
   added: (alighted pad_0_5_0)
   changed: (nectar-level) from 6 to 5
   goals met: 7 of 11
17. (fly_west)
   changed: (east) from 5 to 4, (nectar-level) from 5 to 4
   goals met: 7 of 11
18. (fly_west)
   changed: (east) from 4 to 3, (nectar-level) from 4 to 3
   goals met: 7 of 11
19. (fly_west)
   changed: (east) from 3 to 2, (nectar-level) from 3 to 2
   goals met: 7 of 11
20. (fly_west)
   changed: (east) from 2 to 1, (nectar-level) from 2 to 1
   goals met: 7 of 11
21. (fly_west)
   changed: (east) from 1 to 0, (nectar-level) from 1 to 0
   goals met: 8 of 11
22. (refuel_nectar)
   changed: (nectar-level) from 0 to 21
   goals met: 8 of 11
23. (alight pad_0_0_0)
   added: (alighted pad_0_0_0)
   changed: (nectar-level) from 21 to 20
   goals met: 9 of 11
24. (fly_east)
   changed: (east) from 0 to 1, (nectar-level) from 20 to 19
   goals met: 8 of 11
25. (fly_east)
   changed: (east) from 1 to 2, (nectar-level) from 19 to 18
   goals met: 8 of 11
26. (fly_east)
   changed: (east) from 2 to 3, (nectar-level) from 18 to 17
   goals met: 8 of 11
27. (fly_east)
   changed: (east) from 3 to 4, (nectar-level) from 17 to 16
   goals met: 8 of 11
28. (fly_east)
   changed: (east) from 4 to 5, (nectar-level) from 16 to 15
   goals met: 8 of 11
29. (fly_east)
   changed: (east) from 5 to 6, (nectar-level) from 15 to 14
   goals met: 8 of 11
30. (alight pad_0_6_0)
   added: (alighted pad_0_6_0)
   changed: (nectar-level) from 14 to 13
   goals met: 9 of 11
31. (fly_east)
   changed: (east) from 6 to 7, (nectar-level) from 13 to 12
   goals met: 9 of 11
32. (alight pad_0_7_0)
   added: (alighted pad_0_7_0)
   changed: (nectar-level) from 12 to 11
   goals met: 10 of 11
33. (fly_west)
   changed: (east) from 7 to 6, (nectar-level) from 11 to 10
   goals met: 10 of 11
34. (fly_west)
   changed: (east) from 6 to 5, (nectar-level) from 10 to 9
   goals met: 10 of 11
35. (fly_west)
   changed: (east) from 5 to 4, (nectar-level) from 9 to 8
   goals met: 10 of 11
36. (fly_west)
   changed: (east) from 4 to 3, (nectar-level) from 8 to 7
   goals met: 10 of 11
37. (fly_west)
   changed: (east) from 3 to 2, (nectar-level) from 7 to 6
   goals met: 10 of 11
38. (fly_west)
   changed: (east) from 2 to 1, (nectar-level) from 6 to 5
   goals met: 10 of 11
39. (fly_west)
   changed: (east) from 1 to 0, (nectar-level) from 5 to 4
   goals met: 11 of 11
